tutorials/verification/dynamics/10_baseCasePimpleV2/0.org/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// internalField   uniform 0.985;
internalField   uniform 1;
//~ internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        // value           uniform 0.985;
        value           uniform 1;
    }

    "(outlet|walls|inletCyl|cylinder)"
    {
        type        zeroGradient;
    }

    "(symmetry.*)"
//  channelOfInt1
   {
        type            symmetryPlane;
    }

}

// ************************************************************************* //
