tutorials/verification/dynamics/10_baseCasePimpleV2/0.org/UD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField	uniform	(0 0 0.0);

boundaryField
{
    inlet
    {//good for Re(inlet) specification, inlet height + UX -> Re
        type            fixedValue;
			value	uniform (0 0 0.0);
    }
    inletCyl
    {//good for Re(inlet) specification, inlet height + UX -> Re
        type            fixedValue;
        value           uniform (0 0 UIN_cyl);
    }

    outlet
    {//what comes out, comes out
        type            inletOutlet;
        value           $internalField;//what comes out comes out
        inletValue      uniform (0 0 0);//nothing should go in
    }
    "(walls|cylinder)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    "(symmetry).*"
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
